app/controllers/tutors_controller.rb

  def index
    @tutors = Tutor.all
---
SELECT "tutors".* FROM "tutors"

  def create
    @tutor = Tutor.new(tutor_params)
    if @tutor.save
---
INSERT INTO "tutors" ("name", "image", "description", "price", "city", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"